tap "anomalyco/tap", trusted: true
tap "dlvhdr/formulae"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "homebrew/services"
tap "keith/formulae", trusted: true
tap "lzhgus/tap", trusted: true
tap "modem-dev/tap"
tap "ngrok/ngrok", trusted: true
tap "nikitabobko/tap", trusted: true
tap "nikolaeu/numi", trusted: true
tap "redis-stack/redis-stack", trusted: true
tap "wsagency/tap", trusted: true
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Multi-shell multi-command argument completer
brew "carapace"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Duplicate file utility
brew "czkawka"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lock file during command
brew "flock"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Interactive environments for writing and running code
brew "jupyterlab"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Hash utilities
brew "md5sha1sum", link: true
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Smart session manager for the terminal
brew "sesh"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# General purpose fuzzy finder TUI
brew "television"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compress/expand executable files
brew "upx"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git diff pager based on delta but with a file tree, à la GitHub
brew "dlvhdr/formulae/diffnav", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders"
brew "keith/formulae/reminders-cli"
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# Move, fix, list, verify, prune, and manage Claude Code projects
brew "wsagency/tap/clamp"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Open-source screenshot and screen recording for macOS
cask "lzhgus/tap/capso"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Extensible two-pane file manager
cask "marta"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# MySQL/MariaDB database management
cask "sequel-ace"
# System monitor for the menu bar
cask "stats"
# Menu bar manager
cask "thaw"
go "golang.org/x/tools/gopls"
go "github.com/jackyzha0/hugo-obsidian"
go "github.com/tp86/legimi-go"
uv "graphifyy"
npm "@earendil-works/pi-coding-agent"
npm "@nestjs/cli"
npm "corepack"
npm "llm-checker"
